// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
//

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// console.log(friends.length);
//
// if (friends.length >= 3) {
//     document.write(`це великий масив, в якому 3 і більше елементи а саме ${friends.length}`);
// } else {
//     document.write(`це маленький масив, в якому менше 3-х елементів а саме ${friends.length}.`);
// }

//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// //
// let a = 9;
// let b = 8;
// let c = 20;
// let d;
//
// if (a > b && a < c) {
//     alert(`${a} "перше число між двома іншими"`);
// } else if (b > a && b < c) {
//     alert(b);
// } else if (c > a && c < b) {
//     alert(c);
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let a = 9;
// let b = 8;
// (a + b < 4) ? document.write('Мало') : document.write('Багато');

//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// (a + b < 4) ? document.write('позитивним') : document.write('негативним');

// let number = +prompt('Число?');
//
// let message = (number < -100 && number <=0) ? 'негативним!' :
//     (number === 0) ? 'нулем!' :
//         (number > 0 && number <= 100) ? 'позитивним!' :
//             'введіть будь яке число від -100 , 0 , +100';
//
// alert( message );